docs/evidence/load-runs/failure50-dev-002/k6.txt
$ kubectl -n online-shop-dev logs job/online-shop-load-failure-50

          /\      |‾‾| /‾‾/   /‾‾/   
     /\  /  \     |  |/  /   /  /    
    /  \/    \    |     (   /   ‾‾\  
   /          \   |  |\  \ |  (‾)  | 
  / __________ \  |__| \__\ \_____/ .io

     execution: local
        script: /scripts/failure.js
        output: -

     scenarios: (100.00%) 1 scenario, 20 max VUs, 5m30s max duration (incl. graceful stop):
              * default: 20 looping VUs for 5m0s (gracefulStop: 30s)


running (0m01.0s), 20/20 VUs, 108 complete and 0 interrupted iterations
default   [   0% ] 20 VUs  0m01.0s/5m0s

running (0m02.0s), 20/20 VUs, 258 complete and 0 interrupted iterations
default   [   1% ] 20 VUs  0m02.0s/5m0s

running (0m03.0s), 20/20 VUs, 366 complete and 0 interrupted iterations
default   [   1% ] 20 VUs  0m03.0s/5m0s

running (0m04.0s), 20/20 VUs, 462 complete and 0 interrupted iterations
default   [   1% ] 20 VUs  0m04.0s/5m0s

running (0m05.0s), 20/20 VUs, 542 complete and 0 interrupted iterations
default   [   2% ] 20 VUs  0m05.0s/5m0s

running (0m06.0s), 20/20 VUs, 634 complete and 0 interrupted iterations
default   [   2% ] 20 VUs  0m06.0s/5m0s

running (0m07.0s), 20/20 VUs, 782 complete and 0 interrupted iterations
default   [   2% ] 20 VUs  0m07.0s/5m0s

running (0m08.0s), 20/20 VUs, 888 complete and 0 interrupted iterations
default   [   3% ] 20 VUs  0m08.0s/5m0s

running (0m09.0s), 20/20 VUs, 993 complete and 0 interrupted iterations
default   [   3% ] 20 VUs  0m09.0s/5m0s

running (0m10.0s), 20/20 VUs, 1098 complete and 0 interrupted iterations
default   [   3% ] 20 VUs  0m10.0s/5m0s

running (0m11.0s), 20/20 VUs, 1210 complete and 0 interrupted iterations
default   [   4% ] 20 VUs  0m11.0s/5m0s

running (0m12.0s), 20/20 VUs, 1291 complete and 0 interrupted iterations
default   [   4% ] 20 VUs  0m12.0s/5m0s

running (0m13.0s), 20/20 VUs, 1402 complete and 0 interrupted iterations
default   [   4% ] 20 VUs  0m13.0s/5m0s

running (0m14.0s), 20/20 VUs, 1506 complete and 0 interrupted iterations
default   [   5% ] 20 VUs  0m14.0s/5m0s

running (0m15.0s), 20/20 VUs, 1566 complete and 0 interrupted iterations
default   [   5% ] 20 VUs  0m15.0s/5m0s

running (0m16.0s), 20/20 VUs, 1637 complete and 0 interrupted iterations
default   [   5% ] 20 VUs  0m16.0s/5m0s

running (0m17.0s), 20/20 VUs, 1725 complete and 0 interrupted iterations
default   [   6% ] 20 VUs  0m17.0s/5m0s

running (0m18.0s), 20/20 VUs, 1885 complete and 0 interrupted iterations
default   [   6% ] 20 VUs  0m18.0s/5m0s

running (0m19.0s), 20/20 VUs, 1991 complete and 0 interrupted iterations
default   [   6% ] 20 VUs  0m19.0s/5m0s

running (0m20.0s), 20/20 VUs, 2106 complete and 0 interrupted iterations
default   [   7% ] 20 VUs  0m20.0s/5m0s

running (0m21.0s), 20/20 VUs, 2171 complete and 0 interrupted iterations
default   [   7% ] 20 VUs  0m21.0s/5m0s

running (0m22.0s), 20/20 VUs, 2258 complete and 0 interrupted iterations
default   [   7% ] 20 VUs  0m22.0s/5m0s

running (0m23.0s), 20/20 VUs, 2352 complete and 0 interrupted iterations
default   [   8% ] 20 VUs  0m23.0s/5m0s

running (0m24.0s), 20/20 VUs, 2479 complete and 0 interrupted iterations
default   [   8% ] 20 VUs  0m24.0s/5m0s

running (0m25.0s), 20/20 VUs, 2579 complete and 0 interrupted iterations
default   [   8% ] 20 VUs  0m25.0s/5m0s

running (0m26.0s), 20/20 VUs, 2622 complete and 0 interrupted iterations
default   [   9% ] 20 VUs  0m26.0s/5m0s

running (0m27.0s), 20/20 VUs, 2675 complete and 0 interrupted iterations
default   [   9% ] 20 VUs  0m27.0s/5m0s

running (0m28.0s), 20/20 VUs, 2723 complete and 0 interrupted iterations
default   [   9% ] 20 VUs  0m28.0s/5m0s

running (0m29.0s), 20/20 VUs, 2808 complete and 0 interrupted iterations
default   [  10% ] 20 VUs  0m29.0s/5m0s

running (0m30.0s), 20/20 VUs, 2946 complete and 0 interrupted iterations
default   [  10% ] 20 VUs  0m30.0s/5m0s

running (0m31.0s), 20/20 VUs, 3067 complete and 0 interrupted iterations
default   [  10% ] 20 VUs  0m31.0s/5m0s

running (0m32.0s), 20/20 VUs, 3204 complete and 0 interrupted iterations
default   [  11% ] 20 VUs  0m32.0s/5m0s

running (0m33.0s), 20/20 VUs, 3341 complete and 0 interrupted iterations
default   [  11% ] 20 VUs  0m33.0s/5m0s

running (0m34.0s), 20/20 VUs, 3483 complete and 0 interrupted iterations
default   [  11% ] 20 VUs  0m34.0s/5m0s

running (0m35.0s), 20/20 VUs, 3609 complete and 0 interrupted iterations
default   [  12% ] 20 VUs  0m35.0s/5m0s

running (0m36.0s), 20/20 VUs, 3727 complete and 0 interrupted iterations
default   [  12% ] 20 VUs  0m36.0s/5m0s

running (0m37.0s), 20/20 VUs, 3845 complete and 0 interrupted iterations
default   [  12% ] 20 VUs  0m37.0s/5m0s

running (0m38.0s), 20/20 VUs, 3963 complete and 0 interrupted iterations
default   [  13% ] 20 VUs  0m38.0s/5m0s

running (0m39.0s), 20/20 VUs, 4068 complete and 0 interrupted iterations
default   [  13% ] 20 VUs  0m39.0s/5m0s

running (0m40.0s), 20/20 VUs, 4201 complete and 0 interrupted iterations
default   [  13% ] 20 VUs  0m40.0s/5m0s

running (0m41.0s), 20/20 VUs, 4345 complete and 0 interrupted iterations
default   [  14% ] 20 VUs  0m41.0s/5m0s

running (0m42.0s), 20/20 VUs, 4482 complete and 0 interrupted iterations
default   [  14% ] 20 VUs  0m42.0s/5m0s

running (0m43.0s), 20/20 VUs, 4585 complete and 0 interrupted iterations
default   [  14% ] 20 VUs  0m43.0s/5m0s

running (0m44.0s), 20/20 VUs, 4722 complete and 0 interrupted iterations
default   [  15% ] 20 VUs  0m44.0s/5m0s

running (0m45.0s), 20/20 VUs, 4866 complete and 0 interrupted iterations
default   [  15% ] 20 VUs  0m45.0s/5m0s

running (0m46.0s), 20/20 VUs, 5019 complete and 0 interrupted iterations
default   [  15% ] 20 VUs  0m46.0s/5m0s

running (0m47.0s), 20/20 VUs, 5141 complete and 0 interrupted iterations
default   [  16% ] 20 VUs  0m47.0s/5m0s

running (0m48.0s), 20/20 VUs, 5281 complete and 0 interrupted iterations
default   [  16% ] 20 VUs  0m48.0s/5m0s

running (0m49.0s), 20/20 VUs, 5340 complete and 0 interrupted iterations
default   [  16% ] 20 VUs  0m49.0s/5m0s

running (0m50.0s), 20/20 VUs, 5420 complete and 0 interrupted iterations
default   [  17% ] 20 VUs  0m50.0s/5m0s

running (0m51.0s), 20/20 VUs, 5469 complete and 0 interrupted iterations
default   [  17% ] 20 VUs  0m51.0s/5m0s

running (0m52.0s), 20/20 VUs, 5476 complete and 0 interrupted iterations
default   [  17% ] 20 VUs  0m52.0s/5m0s

running (0m53.0s), 20/20 VUs, 5568 complete and 0 interrupted iterations
default   [  18% ] 20 VUs  0m53.0s/5m0s

running (0m54.0s), 20/20 VUs, 5625 complete and 0 interrupted iterations
default   [  18% ] 20 VUs  0m54.0s/5m0s

running (0m55.0s), 20/20 VUs, 5686 complete and 0 interrupted iterations
default   [  18% ] 20 VUs  0m55.0s/5m0s

running (0m56.0s), 20/20 VUs, 5732 complete and 0 interrupted iterations
default   [  19% ] 20 VUs  0m56.0s/5m0s

running (0m57.0s), 20/20 VUs, 5750 complete and 0 interrupted iterations
default   [  19% ] 20 VUs  0m57.0s/5m0s

running (0m58.0s), 20/20 VUs, 5836 complete and 0 interrupted iterations
default   [  19% ] 20 VUs  0m58.0s/5m0s

running (0m59.0s), 20/20 VUs, 5964 complete and 0 interrupted iterations
default   [  20% ] 20 VUs  0m59.0s/5m0s

running (1m00.0s), 20/20 VUs, 6013 complete and 0 interrupted iterations
default   [  20% ] 20 VUs  1m00.0s/5m0s

running (1m01.0s), 20/20 VUs, 6086 complete and 0 interrupted iterations
default   [  20% ] 20 VUs  1m01.0s/5m0s

running (1m02.0s), 20/20 VUs, 6174 complete and 0 interrupted iterations
default   [  21% ] 20 VUs  1m02.0s/5m0s

running (1m03.0s), 20/20 VUs, 6239 complete and 0 interrupted iterations
default   [  21% ] 20 VUs  1m03.0s/5m0s

running (1m04.0s), 20/20 VUs, 6338 complete and 0 interrupted iterations
default   [  21% ] 20 VUs  1m04.0s/5m0s

running (1m05.0s), 20/20 VUs, 6420 complete and 0 interrupted iterations
default   [  22% ] 20 VUs  1m05.0s/5m0s

running (1m06.0s), 20/20 VUs, 6498 complete and 0 interrupted iterations
default   [  22% ] 20 VUs  1m06.0s/5m0s

running (1m07.0s), 20/20 VUs, 6612 complete and 0 interrupted iterations
default   [  22% ] 20 VUs  1m07.0s/5m0s

running (1m08.0s), 20/20 VUs, 6700 complete and 0 interrupted iterations
default   [  23% ] 20 VUs  1m08.0s/5m0s

running (1m09.0s), 20/20 VUs, 6806 complete and 0 interrupted iterations
default   [  23% ] 20 VUs  1m09.0s/5m0s

running (1m10.0s), 20/20 VUs, 6890 complete and 0 interrupted iterations
default   [  23% ] 20 VUs  1m10.0s/5m0s

running (1m11.0s), 20/20 VUs, 6936 complete and 0 interrupted iterations
default   [  24% ] 20 VUs  1m11.0s/5m0s

running (1m12.0s), 20/20 VUs, 7012 complete and 0 interrupted iterations
default   [  24% ] 20 VUs  1m12.0s/5m0s

running (1m13.0s), 20/20 VUs, 7085 complete and 0 interrupted iterations
default   [  24% ] 20 VUs  1m13.0s/5m0s

running (1m14.0s), 20/20 VUs, 7162 complete and 0 interrupted iterations
default   [  25% ] 20 VUs  1m14.0s/5m0s

running (1m15.0s), 20/20 VUs, 7220 complete and 0 interrupted iterations
default   [  25% ] 20 VUs  1m15.0s/5m0s

running (1m16.0s), 20/20 VUs, 7274 complete and 0 interrupted iterations
default   [  25% ] 20 VUs  1m16.0s/5m0s

running (1m17.0s), 20/20 VUs, 7377 complete and 0 interrupted iterations
default   [  26% ] 20 VUs  1m17.0s/5m0s

running (1m18.0s), 20/20 VUs, 7495 complete and 0 interrupted iterations
default   [  26% ] 20 VUs  1m18.0s/5m0s

running (1m19.0s), 20/20 VUs, 7617 complete and 0 interrupted iterations
default   [  26% ] 20 VUs  1m19.0s/5m0s

running (1m20.0s), 20/20 VUs, 7726 complete and 0 interrupted iterations
default   [  27% ] 20 VUs  1m20.0s/5m0s

running (1m21.0s), 20/20 VUs, 7800 complete and 0 interrupted iterations
default   [  27% ] 20 VUs  1m21.0s/5m0s

running (1m22.0s), 20/20 VUs, 7827 complete and 0 interrupted iterations
default   [  27% ] 20 VUs  1m22.0s/5m0s

running (1m23.0s), 20/20 VUs, 7892 complete and 0 interrupted iterations
default   [  28% ] 20 VUs  1m23.0s/5m0s

running (1m24.0s), 20/20 VUs, 7991 complete and 0 interrupted iterations
default   [  28% ] 20 VUs  1m24.0s/5m0s

running (1m25.0s), 20/20 VUs, 8065 complete and 0 interrupted iterations
default   [  28% ] 20 VUs  1m25.0s/5m0s

running (1m26.0s), 20/20 VUs, 8137 complete and 0 interrupted iterations
default   [  29% ] 20 VUs  1m26.0s/5m0s

running (1m27.0s), 20/20 VUs, 8188 complete and 0 interrupted iterations
default   [  29% ] 20 VUs  1m27.0s/5m0s

running (1m28.0s), 20/20 VUs, 8231 complete and 0 interrupted iterations
default   [  29% ] 20 VUs  1m28.0s/5m0s

running (1m29.0s), 20/20 VUs, 8314 complete and 0 interrupted iterations
default   [  30% ] 20 VUs  1m29.0s/5m0s

running (1m30.0s), 20/20 VUs, 8403 complete and 0 interrupted iterations
default   [  30% ] 20 VUs  1m30.0s/5m0s

running (1m31.0s), 20/20 VUs, 8496 complete and 0 interrupted iterations
default   [  30% ] 20 VUs  1m31.0s/5m0s

running (1m32.0s), 20/20 VUs, 8590 complete and 0 interrupted iterations
default   [  31% ] 20 VUs  1m32.0s/5m0s

running (1m33.0s), 20/20 VUs, 8647 complete and 0 interrupted iterations
default   [  31% ] 20 VUs  1m33.0s/5m0s

running (1m34.0s), 20/20 VUs, 8720 complete and 0 interrupted iterations
default   [  31% ] 20 VUs  1m34.0s/5m0s

running (1m35.0s), 20/20 VUs, 8775 complete and 0 interrupted iterations
default   [  32% ] 20 VUs  1m35.0s/5m0s

running (1m36.0s), 20/20 VUs, 8777 complete and 0 interrupted iterations
default   [  32% ] 20 VUs  1m36.0s/5m0s

running (1m37.0s), 20/20 VUs, 8784 complete and 0 interrupted iterations
default   [  32% ] 20 VUs  1m37.0s/5m0s

running (1m38.0s), 20/20 VUs, 8837 complete and 0 interrupted iterations
default   [  33% ] 20 VUs  1m38.0s/5m0s

running (1m39.0s), 20/20 VUs, 8863 complete and 0 interrupted iterations
default   [  33% ] 20 VUs  1m39.0s/5m0s

running (1m40.0s), 20/20 VUs, 8921 complete and 0 interrupted iterations
default   [  33% ] 20 VUs  1m40.0s/5m0s

running (1m41.0s), 20/20 VUs, 8994 complete and 0 interrupted iterations
default   [  34% ] 20 VUs  1m41.0s/5m0s

running (1m42.0s), 20/20 VUs, 9068 complete and 0 interrupted iterations
default   [  34% ] 20 VUs  1m42.0s/5m0s

running (1m43.0s), 20/20 VUs, 9131 complete and 0 interrupted iterations
default   [  34% ] 20 VUs  1m43.0s/5m0s

running (1m44.0s), 20/20 VUs, 9164 complete and 0 interrupted iterations
default   [  35% ] 20 VUs  1m44.0s/5m0s

running (1m45.0s), 20/20 VUs, 9245 complete and 0 interrupted iterations
default   [  35% ] 20 VUs  1m45.0s/5m0s

running (1m46.0s), 20/20 VUs, 9322 complete and 0 interrupted iterations
default   [  35% ] 20 VUs  1m46.0s/5m0s

running (1m47.0s), 20/20 VUs, 9402 complete and 0 interrupted iterations
default   [  36% ] 20 VUs  1m47.0s/5m0s

running (1m48.0s), 20/20 VUs, 9511 complete and 0 interrupted iterations
default   [  36% ] 20 VUs  1m48.0s/5m0s

running (1m49.0s), 20/20 VUs, 9649 complete and 0 interrupted iterations
default   [  36% ] 20 VUs  1m49.0s/5m0s

running (1m50.0s), 20/20 VUs, 9750 complete and 0 interrupted iterations
default   [  37% ] 20 VUs  1m50.0s/5m0s

running (1m51.0s), 20/20 VUs, 9802 complete and 0 interrupted iterations
default   [  37% ] 20 VUs  1m51.0s/5m0s

running (1m52.0s), 20/20 VUs, 9861 complete and 0 interrupted iterations
default   [  37% ] 20 VUs  1m52.0s/5m0s

running (1m53.0s), 20/20 VUs, 9917 complete and 0 interrupted iterations
default   [  38% ] 20 VUs  1m53.0s/5m0s

running (1m54.0s), 20/20 VUs, 10000 complete and 0 interrupted iterations
default   [  38% ] 20 VUs  1m54.0s/5m0s

running (1m55.0s), 20/20 VUs, 10083 complete and 0 interrupted iterations
default   [  38% ] 20 VUs  1m55.0s/5m0s

running (1m56.0s), 20/20 VUs, 10119 complete and 0 interrupted iterations
default   [  39% ] 20 VUs  1m56.0s/5m0s

running (1m57.0s), 20/20 VUs, 10165 complete and 0 interrupted iterations
default   [  39% ] 20 VUs  1m57.0s/5m0s

running (1m58.0s), 20/20 VUs, 10208 complete and 0 interrupted iterations
default   [  39% ] 20 VUs  1m58.0s/5m0s

running (1m59.0s), 20/20 VUs, 10236 complete and 0 interrupted iterations
default   [  40% ] 20 VUs  1m59.0s/5m0s

running (2m00.0s), 20/20 VUs, 10273 complete and 0 interrupted iterations
default   [  40% ] 20 VUs  2m00.0s/5m0s

running (2m01.0s), 20/20 VUs, 10362 complete and 0 interrupted iterations
default   [  40% ] 20 VUs  2m01.0s/5m0s

running (2m02.0s), 20/20 VUs, 10449 complete and 0 interrupted iterations
default   [  41% ] 20 VUs  2m02.0s/5m0s

running (2m03.0s), 20/20 VUs, 10508 complete and 0 interrupted iterations
default   [  41% ] 20 VUs  2m03.0s/5m0s

running (2m04.0s), 20/20 VUs, 10616 complete and 0 interrupted iterations
default   [  41% ] 20 VUs  2m04.0s/5m0s

running (2m05.0s), 20/20 VUs, 10682 complete and 0 interrupted iterations
default   [  42% ] 20 VUs  2m05.0s/5m0s

running (2m06.0s), 20/20 VUs, 10738 complete and 0 interrupted iterations
default   [  42% ] 20 VUs  2m06.0s/5m0s

running (2m07.0s), 20/20 VUs, 10836 complete and 0 interrupted iterations
default   [  42% ] 20 VUs  2m07.0s/5m0s

running (2m08.0s), 20/20 VUs, 10907 complete and 0 interrupted iterations
default   [  43% ] 20 VUs  2m08.0s/5m0s

running (2m09.0s), 20/20 VUs, 11019 complete and 0 interrupted iterations
default   [  43% ] 20 VUs  2m09.0s/5m0s

running (2m10.0s), 20/20 VUs, 11137 complete and 0 interrupted iterations
default   [  43% ] 20 VUs  2m10.0s/5m0s

running (2m11.0s), 20/20 VUs, 11253 complete and 0 interrupted iterations
default   [  44% ] 20 VUs  2m11.0s/5m0s

running (2m12.0s), 20/20 VUs, 11359 complete and 0 interrupted iterations
default   [  44% ] 20 VUs  2m12.0s/5m0s

running (2m13.0s), 20/20 VUs, 11475 complete and 0 interrupted iterations
default   [  44% ] 20 VUs  2m13.0s/5m0s

running (2m14.0s), 20/20 VUs, 11541 complete and 0 interrupted iterations
default   [  45% ] 20 VUs  2m14.0s/5m0s

running (2m15.0s), 20/20 VUs, 11588 complete and 0 interrupted iterations
default   [  45% ] 20 VUs  2m15.0s/5m0s

running (2m16.0s), 20/20 VUs, 11640 complete and 0 interrupted iterations
default   [  45% ] 20 VUs  2m16.0s/5m0s

running (2m17.0s), 20/20 VUs, 11714 complete and 0 interrupted iterations
default   [  46% ] 20 VUs  2m17.0s/5m0s

running (2m18.0s), 20/20 VUs, 11815 complete and 0 interrupted iterations
default   [  46% ] 20 VUs  2m18.0s/5m0s

running (2m19.0s), 20/20 VUs, 11943 complete and 0 interrupted iterations
default   [  46% ] 20 VUs  2m19.0s/5m0s

running (2m20.0s), 20/20 VUs, 12037 complete and 0 interrupted iterations
default   [  47% ] 20 VUs  2m20.0s/5m0s

running (2m21.0s), 20/20 VUs, 12077 complete and 0 interrupted iterations
default   [  47% ] 20 VUs  2m21.0s/5m0s

running (2m22.0s), 20/20 VUs, 12111 complete and 0 interrupted iterations
default   [  47% ] 20 VUs  2m22.0s/5m0s

running (2m23.0s), 20/20 VUs, 12173 complete and 0 interrupted iterations
default   [  48% ] 20 VUs  2m23.0s/5m0s

running (2m24.0s), 20/20 VUs, 12226 complete and 0 interrupted iterations
default   [  48% ] 20 VUs  2m24.0s/5m0s

running (2m25.0s), 20/20 VUs, 12272 complete and 0 interrupted iterations
default   [  48% ] 20 VUs  2m25.0s/5m0s

running (2m26.0s), 20/20 VUs, 12310 complete and 0 interrupted iterations
default   [  49% ] 20 VUs  2m26.0s/5m0s

running (2m27.0s), 20/20 VUs, 12350 complete and 0 interrupted iterations
default   [  49% ] 20 VUs  2m27.0s/5m0s

running (2m28.0s), 20/20 VUs, 12405 complete and 0 interrupted iterations
default   [  49% ] 20 VUs  2m28.0s/5m0s

running (2m29.0s), 20/20 VUs, 12447 complete and 0 interrupted iterations
default   [  50% ] 20 VUs  2m29.0s/5m0s

running (2m30.0s), 20/20 VUs, 12503 complete and 0 interrupted iterations
default   [  50% ] 20 VUs  2m30.0s/5m0s

running (2m31.0s), 20/20 VUs, 12537 complete and 0 interrupted iterations
default   [  50% ] 20 VUs  2m31.0s/5m0s

running (2m32.0s), 20/20 VUs, 12568 complete and 0 interrupted iterations
default   [  51% ] 20 VUs  2m32.0s/5m0s

running (2m33.0s), 20/20 VUs, 12627 complete and 0 interrupted iterations
default   [  51% ] 20 VUs  2m33.0s/5m0s

running (2m34.0s), 20/20 VUs, 12695 complete and 0 interrupted iterations
default   [  51% ] 20 VUs  2m34.0s/5m0s

running (2m35.0s), 20/20 VUs, 12791 complete and 0 interrupted iterations
default   [  52% ] 20 VUs  2m35.0s/5m0s

running (2m36.0s), 20/20 VUs, 12902 complete and 0 interrupted iterations
default   [  52% ] 20 VUs  2m36.0s/5m0s

running (2m37.0s), 20/20 VUs, 12977 complete and 0 interrupted iterations
default   [  52% ] 20 VUs  2m37.0s/5m0s

running (2m38.0s), 20/20 VUs, 13069 complete and 0 interrupted iterations
default   [  53% ] 20 VUs  2m38.0s/5m0s

running (2m39.0s), 20/20 VUs, 13170 complete and 0 interrupted iterations
default   [  53% ] 20 VUs  2m39.0s/5m0s

running (2m40.0s), 20/20 VUs, 13282 complete and 0 interrupted iterations
default   [  53% ] 20 VUs  2m40.0s/5m0s

running (2m41.0s), 20/20 VUs, 13374 complete and 0 interrupted iterations
default   [  54% ] 20 VUs  2m41.0s/5m0s

running (2m42.0s), 20/20 VUs, 13467 complete and 0 interrupted iterations
default   [  54% ] 20 VUs  2m42.0s/5m0s

running (2m43.0s), 20/20 VUs, 13592 complete and 0 interrupted iterations
default   [  54% ] 20 VUs  2m43.0s/5m0s

running (2m44.0s), 20/20 VUs, 13702 complete and 0 interrupted iterations
default   [  55% ] 20 VUs  2m44.0s/5m0s

running (2m45.0s), 20/20 VUs, 13808 complete and 0 interrupted iterations
default   [  55% ] 20 VUs  2m45.0s/5m0s

running (2m46.0s), 20/20 VUs, 13929 complete and 0 interrupted iterations
default   [  55% ] 20 VUs  2m46.0s/5m0s

running (2m47.0s), 20/20 VUs, 14050 complete and 0 interrupted iterations
default   [  56% ] 20 VUs  2m47.0s/5m0s

running (2m48.0s), 20/20 VUs, 14174 complete and 0 interrupted iterations
default   [  56% ] 20 VUs  2m48.0s/5m0s

running (2m49.0s), 20/20 VUs, 14314 complete and 0 interrupted iterations
default   [  56% ] 20 VUs  2m49.0s/5m0s

running (2m50.0s), 20/20 VUs, 14402 complete and 0 interrupted iterations
default   [  57% ] 20 VUs  2m50.0s/5m0s

running (2m51.0s), 20/20 VUs, 14449 complete and 0 interrupted iterations
default   [  57% ] 20 VUs  2m51.0s/5m0s

running (2m52.0s), 20/20 VUs, 14485 complete and 0 interrupted iterations
default   [  57% ] 20 VUs  2m52.0s/5m0s

running (2m53.0s), 20/20 VUs, 14546 complete and 0 interrupted iterations
default   [  58% ] 20 VUs  2m53.0s/5m0s

running (2m54.0s), 20/20 VUs, 14590 complete and 0 interrupted iterations
default   [  58% ] 20 VUs  2m54.0s/5m0s

running (2m55.0s), 20/20 VUs, 14624 complete and 0 interrupted iterations
default   [  58% ] 20 VUs  2m55.0s/5m0s

running (2m56.0s), 20/20 VUs, 14660 complete and 0 interrupted iterations
default   [  59% ] 20 VUs  2m56.0s/5m0s

running (2m57.0s), 20/20 VUs, 14676 complete and 0 interrupted iterations
default   [  59% ] 20 VUs  2m57.0s/5m0s

running (2m58.0s), 20/20 VUs, 14699 complete and 0 interrupted iterations
default   [  59% ] 20 VUs  2m58.0s/5m0s

running (2m59.0s), 20/20 VUs, 14767 complete and 0 interrupted iterations
default   [  60% ] 20 VUs  2m59.0s/5m0s

running (3m00.0s), 20/20 VUs, 14819 complete and 0 interrupted iterations
default   [  60% ] 20 VUs  3m00.0s/5m0s

running (3m01.0s), 20/20 VUs, 14888 complete and 0 interrupted iterations
default   [  60% ] 20 VUs  3m01.0s/5m0s

running (3m02.0s), 20/20 VUs, 14947 complete and 0 interrupted iterations
default   [  61% ] 20 VUs  3m02.0s/5m0s

running (3m03.0s), 20/20 VUs, 15023 complete and 0 interrupted iterations
default   [  61% ] 20 VUs  3m03.0s/5m0s

running (3m04.0s), 20/20 VUs, 15044 complete and 0 interrupted iterations
default   [  61% ] 20 VUs  3m04.0s/5m0s

running (3m05.0s), 20/20 VUs, 15078 complete and 0 interrupted iterations
default   [  62% ] 20 VUs  3m05.0s/5m0s

running (3m06.0s), 20/20 VUs, 15104 complete and 0 interrupted iterations
default   [  62% ] 20 VUs  3m06.0s/5m0s

running (3m07.0s), 20/20 VUs, 15135 complete and 0 interrupted iterations
default   [  62% ] 20 VUs  3m07.0s/5m0s

running (3m08.0s), 20/20 VUs, 15213 complete and 0 interrupted iterations
default   [  63% ] 20 VUs  3m08.0s/5m0s

running (3m09.0s), 20/20 VUs, 15277 complete and 0 interrupted iterations
default   [  63% ] 20 VUs  3m09.0s/5m0s

running (3m10.0s), 20/20 VUs, 15319 complete and 0 interrupted iterations
default   [  63% ] 20 VUs  3m10.0s/5m0s

running (3m11.0s), 20/20 VUs, 15393 complete and 0 interrupted iterations
default   [  64% ] 20 VUs  3m11.0s/5m0s

running (3m12.0s), 20/20 VUs, 15469 complete and 0 interrupted iterations
default   [  64% ] 20 VUs  3m12.0s/5m0s

running (3m13.0s), 20/20 VUs, 15536 complete and 0 interrupted iterations
default   [  64% ] 20 VUs  3m13.0s/5m0s

running (3m14.0s), 20/20 VUs, 15583 complete and 0 interrupted iterations
default   [  65% ] 20 VUs  3m14.0s/5m0s

running (3m15.0s), 20/20 VUs, 15632 complete and 0 interrupted iterations
default   [  65% ] 20 VUs  3m15.0s/5m0s

running (3m16.0s), 20/20 VUs, 15716 complete and 0 interrupted iterations
default   [  65% ] 20 VUs  3m16.0s/5m0s

running (3m17.0s), 20/20 VUs, 15726 complete and 0 interrupted iterations
default   [  66% ] 20 VUs  3m17.0s/5m0s

running (3m18.0s), 20/20 VUs, 15741 complete and 0 interrupted iterations
default   [  66% ] 20 VUs  3m18.0s/5m0s

running (3m19.0s), 20/20 VUs, 15806 complete and 0 interrupted iterations
default   [  66% ] 20 VUs  3m19.0s/5m0s

running (3m20.0s), 20/20 VUs, 15865 complete and 0 interrupted iterations
default   [  67% ] 20 VUs  3m20.0s/5m0s

running (3m21.0s), 20/20 VUs, 15901 complete and 0 interrupted iterations
default   [  67% ] 20 VUs  3m21.0s/5m0s

running (3m22.0s), 20/20 VUs, 15936 complete and 0 interrupted iterations
default   [  67% ] 20 VUs  3m22.0s/5m0s

running (3m23.0s), 20/20 VUs, 16000 complete and 0 interrupted iterations
default   [  68% ] 20 VUs  3m23.0s/5m0s

running (3m24.0s), 20/20 VUs, 16037 complete and 0 interrupted iterations
default   [  68% ] 20 VUs  3m24.0s/5m0s

running (3m25.0s), 20/20 VUs, 16096 complete and 0 interrupted iterations
default   [  68% ] 20 VUs  3m25.0s/5m0s

running (3m26.0s), 20/20 VUs, 16165 complete and 0 interrupted iterations
default   [  69% ] 20 VUs  3m26.0s/5m0s

running (3m27.0s), 20/20 VUs, 16188 complete and 0 interrupted iterations
default   [  69% ] 20 VUs  3m27.0s/5m0s

running (3m28.0s), 20/20 VUs, 16213 complete and 0 interrupted iterations
default   [  69% ] 20 VUs  3m28.0s/5m0s

running (3m29.0s), 20/20 VUs, 16240 complete and 0 interrupted iterations
default   [  70% ] 20 VUs  3m29.0s/5m0s

running (3m30.0s), 20/20 VUs, 16244 complete and 0 interrupted iterations
default   [  70% ] 20 VUs  3m30.0s/5m0s

running (3m31.0s), 20/20 VUs, 16275 complete and 0 interrupted iterations
default   [  70% ] 20 VUs  3m31.0s/5m0s

running (3m32.0s), 20/20 VUs, 16303 complete and 0 interrupted iterations
default   [  71% ] 20 VUs  3m32.0s/5m0s

running (3m33.0s), 20/20 VUs, 16371 complete and 0 interrupted iterations
default   [  71% ] 20 VUs  3m33.0s/5m0s

running (3m34.0s), 20/20 VUs, 16472 complete and 0 interrupted iterations
default   [  71% ] 20 VUs  3m34.0s/5m0s

running (3m35.0s), 20/20 VUs, 16539 complete and 0 interrupted iterations
default   [  72% ] 20 VUs  3m35.0s/5m0s

running (3m36.0s), 20/20 VUs, 16594 complete and 0 interrupted iterations
default   [  72% ] 20 VUs  3m36.0s/5m0s

running (3m37.0s), 20/20 VUs, 16631 complete and 0 interrupted iterations
default   [  72% ] 20 VUs  3m37.0s/5m0s

running (3m38.0s), 20/20 VUs, 16686 complete and 0 interrupted iterations
default   [  73% ] 20 VUs  3m38.0s/5m0s

running (3m39.0s), 20/20 VUs, 16778 complete and 0 interrupted iterations
default   [  73% ] 20 VUs  3m39.0s/5m0s

running (3m40.0s), 20/20 VUs, 16811 complete and 0 interrupted iterations
default   [  73% ] 20 VUs  3m40.0s/5m0s

running (3m41.0s), 20/20 VUs, 16837 complete and 0 interrupted iterations
default   [  74% ] 20 VUs  3m41.0s/5m0s

running (3m42.0s), 20/20 VUs, 16878 complete and 0 interrupted iterations
default   [  74% ] 20 VUs  3m42.0s/5m0s

running (3m43.0s), 20/20 VUs, 16966 complete and 0 interrupted iterations
default   [  74% ] 20 VUs  3m43.0s/5m0s

running (3m44.0s), 20/20 VUs, 17074 complete and 0 interrupted iterations
default   [  75% ] 20 VUs  3m44.0s/5m0s

running (3m45.0s), 20/20 VUs, 17126 complete and 0 interrupted iterations
default   [  75% ] 20 VUs  3m45.0s/5m0s

running (3m46.0s), 20/20 VUs, 17172 complete and 0 interrupted iterations
default   [  75% ] 20 VUs  3m46.0s/5m0s

running (3m47.0s), 20/20 VUs, 17216 complete and 0 interrupted iterations
default   [  76% ] 20 VUs  3m47.0s/5m0s

running (3m48.0s), 20/20 VUs, 17309 complete and 0 interrupted iterations
default   [  76% ] 20 VUs  3m48.0s/5m0s

running (3m49.0s), 20/20 VUs, 17399 complete and 0 interrupted iterations
default   [  76% ] 20 VUs  3m49.0s/5m0s

running (3m50.0s), 20/20 VUs, 17509 complete and 0 interrupted iterations
default   [  77% ] 20 VUs  3m50.0s/5m0s

running (3m51.0s), 20/20 VUs, 17582 complete and 0 interrupted iterations
default   [  77% ] 20 VUs  3m51.0s/5m0s

running (3m52.0s), 20/20 VUs, 17631 complete and 0 interrupted iterations
default   [  77% ] 20 VUs  3m52.0s/5m0s

running (3m53.0s), 20/20 VUs, 17698 complete and 0 interrupted iterations
default   [  78% ] 20 VUs  3m53.0s/5m0s

running (3m54.0s), 20/20 VUs, 17793 complete and 0 interrupted iterations
default   [  78% ] 20 VUs  3m54.0s/5m0s

running (3m55.0s), 20/20 VUs, 17834 complete and 0 interrupted iterations
default   [  78% ] 20 VUs  3m55.0s/5m0s

running (3m56.0s), 20/20 VUs, 17874 complete and 0 interrupted iterations
default   [  79% ] 20 VUs  3m56.0s/5m0s

running (3m57.0s), 20/20 VUs, 17894 complete and 0 interrupted iterations
default   [  79% ] 20 VUs  3m57.0s/5m0s

running (3m58.0s), 20/20 VUs, 17983 complete and 0 interrupted iterations
default   [  79% ] 20 VUs  3m58.0s/5m0s

running (3m59.0s), 20/20 VUs, 18078 complete and 0 interrupted iterations
default   [  80% ] 20 VUs  3m59.0s/5m0s

running (4m00.0s), 20/20 VUs, 18173 complete and 0 interrupted iterations
default   [  80% ] 20 VUs  4m00.0s/5m0s

running (4m01.0s), 20/20 VUs, 18266 complete and 0 interrupted iterations
default   [  80% ] 20 VUs  4m01.0s/5m0s

running (4m02.0s), 20/20 VUs, 18310 complete and 0 interrupted iterations
default   [  81% ] 20 VUs  4m02.0s/5m0s

running (4m03.0s), 20/20 VUs, 18393 complete and 0 interrupted iterations
default   [  81% ] 20 VUs  4m03.0s/5m0s

running (4m04.0s), 20/20 VUs, 18493 complete and 0 interrupted iterations
default   [  81% ] 20 VUs  4m04.0s/5m0s

running (4m05.0s), 20/20 VUs, 18579 complete and 0 interrupted iterations
default   [  82% ] 20 VUs  4m05.0s/5m0s

running (4m06.0s), 20/20 VUs, 18627 complete and 0 interrupted iterations
default   [  82% ] 20 VUs  4m06.0s/5m0s

running (4m07.0s), 20/20 VUs, 18654 complete and 0 interrupted iterations
default   [  82% ] 20 VUs  4m07.0s/5m0s

running (4m08.0s), 20/20 VUs, 18731 complete and 0 interrupted iterations
default   [  83% ] 20 VUs  4m08.0s/5m0s

running (4m09.0s), 20/20 VUs, 18825 complete and 0 interrupted iterations
default   [  83% ] 20 VUs  4m09.0s/5m0s

running (4m10.0s), 20/20 VUs, 18914 complete and 0 interrupted iterations
default   [  83% ] 20 VUs  4m10.0s/5m0s

running (4m11.0s), 20/20 VUs, 19004 complete and 0 interrupted iterations
default   [  84% ] 20 VUs  4m11.0s/5m0s

running (4m12.0s), 20/20 VUs, 19095 complete and 0 interrupted iterations
default   [  84% ] 20 VUs  4m12.0s/5m0s

running (4m13.0s), 20/20 VUs, 19170 complete and 0 interrupted iterations
default   [  84% ] 20 VUs  4m13.0s/5m0s

running (4m14.0s), 20/20 VUs, 19217 complete and 0 interrupted iterations
default   [  85% ] 20 VUs  4m14.0s/5m0s

running (4m15.0s), 20/20 VUs, 19275 complete and 0 interrupted iterations
default   [  85% ] 20 VUs  4m15.0s/5m0s

running (4m16.0s), 20/20 VUs, 19333 complete and 0 interrupted iterations
default   [  85% ] 20 VUs  4m16.0s/5m0s

running (4m17.0s), 20/20 VUs, 19400 complete and 0 interrupted iterations
default   [  86% ] 20 VUs  4m17.0s/5m0s

running (4m18.0s), 20/20 VUs, 19443 complete and 0 interrupted iterations
default   [  86% ] 20 VUs  4m18.0s/5m0s

running (4m19.0s), 20/20 VUs, 19568 complete and 0 interrupted iterations
default   [  86% ] 20 VUs  4m19.0s/5m0s

running (4m20.0s), 20/20 VUs, 19611 complete and 0 interrupted iterations
default   [  87% ] 20 VUs  4m20.0s/5m0s

running (4m21.0s), 20/20 VUs, 19646 complete and 0 interrupted iterations
default   [  87% ] 20 VUs  4m21.0s/5m0s

running (4m22.0s), 20/20 VUs, 19692 complete and 0 interrupted iterations
default   [  87% ] 20 VUs  4m22.0s/5m0s

running (4m23.0s), 20/20 VUs, 19774 complete and 0 interrupted iterations
default   [  88% ] 20 VUs  4m23.0s/5m0s

running (4m24.0s), 20/20 VUs, 19881 complete and 0 interrupted iterations
default   [  88% ] 20 VUs  4m24.0s/5m0s

running (4m25.0s), 20/20 VUs, 19935 complete and 0 interrupted iterations
default   [  88% ] 20 VUs  4m25.0s/5m0s

running (4m26.0s), 20/20 VUs, 19960 complete and 0 interrupted iterations
default   [  89% ] 20 VUs  4m26.0s/5m0s

running (4m27.0s), 20/20 VUs, 20020 complete and 0 interrupted iterations
default   [  89% ] 20 VUs  4m27.0s/5m0s

running (4m28.0s), 20/20 VUs, 20066 complete and 0 interrupted iterations
default   [  89% ] 20 VUs  4m28.0s/5m0s

running (4m29.0s), 20/20 VUs, 20145 complete and 0 interrupted iterations
default   [  90% ] 20 VUs  4m29.0s/5m0s

running (4m30.0s), 20/20 VUs, 20198 complete and 0 interrupted iterations
default   [  90% ] 20 VUs  4m30.0s/5m0s

running (4m31.0s), 20/20 VUs, 20299 complete and 0 interrupted iterations
default   [  90% ] 20 VUs  4m31.0s/5m0s

running (4m32.0s), 20/20 VUs, 20416 complete and 0 interrupted iterations
default   [  91% ] 20 VUs  4m32.0s/5m0s

running (4m33.0s), 20/20 VUs, 20512 complete and 0 interrupted iterations
default   [  91% ] 20 VUs  4m33.0s/5m0s

running (4m34.0s), 20/20 VUs, 20598 complete and 0 interrupted iterations
default   [  91% ] 20 VUs  4m34.0s/5m0s

running (4m35.0s), 20/20 VUs, 20698 complete and 0 interrupted iterations
default   [  92% ] 20 VUs  4m35.0s/5m0s

running (4m36.0s), 20/20 VUs, 20760 complete and 0 interrupted iterations
default   [  92% ] 20 VUs  4m36.0s/5m0s

running (4m37.0s), 20/20 VUs, 20843 complete and 0 interrupted iterations
default   [  92% ] 20 VUs  4m37.0s/5m0s

running (4m38.0s), 20/20 VUs, 20951 complete and 0 interrupted iterations
default   [  93% ] 20 VUs  4m38.0s/5m0s

running (4m39.0s), 20/20 VUs, 21039 complete and 0 interrupted iterations
default   [  93% ] 20 VUs  4m39.0s/5m0s

running (4m40.0s), 20/20 VUs, 21109 complete and 0 interrupted iterations
default   [  93% ] 20 VUs  4m40.0s/5m0s

running (4m41.0s), 20/20 VUs, 21175 complete and 0 interrupted iterations
default   [  94% ] 20 VUs  4m41.0s/5m0s

running (4m42.0s), 20/20 VUs, 21259 complete and 0 interrupted iterations
default   [  94% ] 20 VUs  4m42.0s/5m0s

running (4m43.0s), 20/20 VUs, 21341 complete and 0 interrupted iterations
default   [  94% ] 20 VUs  4m43.0s/5m0s

running (4m44.0s), 20/20 VUs, 21460 complete and 0 interrupted iterations
default   [  95% ] 20 VUs  4m44.0s/5m0s

running (4m45.0s), 20/20 VUs, 21568 complete and 0 interrupted iterations
default   [  95% ] 20 VUs  4m45.0s/5m0s

running (4m46.0s), 20/20 VUs, 21662 complete and 0 interrupted iterations
default   [  95% ] 20 VUs  4m46.0s/5m0s

running (4m47.0s), 20/20 VUs, 21727 complete and 0 interrupted iterations
default   [  96% ] 20 VUs  4m47.0s/5m0s

running (4m48.0s), 20/20 VUs, 21856 complete and 0 interrupted iterations
default   [  96% ] 20 VUs  4m48.0s/5m0s

running (4m49.0s), 20/20 VUs, 21972 complete and 0 interrupted iterations
default   [  96% ] 20 VUs  4m49.0s/5m0s

running (4m50.0s), 20/20 VUs, 22052 complete and 0 interrupted iterations
default   [  97% ] 20 VUs  4m50.0s/5m0s

running (4m51.0s), 20/20 VUs, 22122 complete and 0 interrupted iterations
default   [  97% ] 20 VUs  4m51.0s/5m0s

running (4m52.0s), 20/20 VUs, 22181 complete and 0 interrupted iterations
default   [  97% ] 20 VUs  4m52.0s/5m0s

running (4m53.0s), 20/20 VUs, 22285 complete and 0 interrupted iterations
default   [  98% ] 20 VUs  4m53.0s/5m0s

running (4m54.0s), 20/20 VUs, 22382 complete and 0 interrupted iterations
default   [  98% ] 20 VUs  4m54.0s/5m0s

running (4m55.0s), 20/20 VUs, 22446 complete and 0 interrupted iterations
default   [  98% ] 20 VUs  4m55.0s/5m0s

running (4m56.0s), 20/20 VUs, 22495 complete and 0 interrupted iterations
default   [  99% ] 20 VUs  4m56.0s/5m0s

running (4m57.0s), 20/20 VUs, 22512 complete and 0 interrupted iterations
default   [  99% ] 20 VUs  4m57.0s/5m0s

running (4m58.0s), 20/20 VUs, 22544 complete and 0 interrupted iterations
default   [  99% ] 20 VUs  4m58.0s/5m0s

running (4m59.0s), 20/20 VUs, 22667 complete and 0 interrupted iterations
default   [ 100% ] 20 VUs  4m59.0s/5m0s

running (5m00.0s), 20/20 VUs, 22737 complete and 0 interrupted iterations
default   [ 100% ] 20 VUs  5m00.0s/5m0s

     ✓ failure: response received
     ✓ failure: generated 5xx

     checks.....................: 100.00% ✓ 45514     ✗ 0   
     data_received..............: 5.3 MB  18 kB/s
     data_sent..................: 2.9 MB  9.6 kB/s
     http_req_blocked...........: avg=70.61µs  min=2.1µs    med=7.6µs    max=59.5ms  p(90)=10.53µs  p(95)=21.83µs 
     http_req_connecting........: avg=2.07µs   min=0s       med=0s       max=4.06ms  p(90)=0s       p(95)=0s      
     http_req_duration..........: avg=161.83ms min=840.11µs med=93.21ms  max=2.7s    p(90)=389.01ms p(95)=550.65ms
     http_req_failed............: 100.00% ✓ 22757     ✗ 0   
     http_req_receiving.........: avg=317.53µs min=13.13µs  med=121.11µs max=19.13ms p(90)=750.5µs  p(95)=1.19ms  
     http_req_sending...........: avg=130.17µs min=8.05µs   med=30.26µs  max=31.28ms p(90)=181.38µs p(95)=481.19µs
     http_req_tls_handshaking...: avg=0s       min=0s       med=0s       max=0s      p(90)=0s       p(95)=0s      
     http_req_waiting...........: avg=161.39ms min=734.89µs med=92.87ms  max=2.7s    p(90)=388.21ms p(95)=550.2ms 
     http_reqs..................: 22757   75.814608/s
     iteration_duration.........: avg=263.63ms min=101.26ms med=195.21ms max=2.8s    p(90)=491.03ms p(95)=652.37ms
     iterations.................: 22757   75.814608/s
     vus........................: 20      min=20      max=20
     vus_max....................: 20      min=20      max=20


running (5m00.2s), 00/20 VUs, 22757 complete and 0 interrupted iterations
default ✓ [ 100% ] 20 VUs  5m0s